1cdiplom/src/Documents/ВыплатаЗарплаты/ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатаЗарплаты</name>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1cdiplom/src/CalculationRegisters/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Начисление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

1cdiplom/src/CalculationRegisters/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Начисление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

1cdiplom/src/CalculationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Удержания</chartOfCalculationTypes>
  <resources>
    <name>Удержано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипУдержания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

1cdiplom/src/Documents/ВыплатаЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере()
	Для Каждого Строка Из Объект.Выплаты Цикл
		Запись = ЭтотОбъект.РегистрыНакопления.ВзаиморасчетыССотрудниками.Добавить();
		Запись.Сотрудник = Строка.Сотрудник;
		Запись.Сумма = Строка.Сумма;
		Запись.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Выплаты.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не обнаружены данные сотрудников для проведения выплат зарплат!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	//@skip-check invocation-form-event-handler
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАвтозаполнение()
	Сотрудник = Справочники.Пользователи.Выбрать();
	Пока Сотрудник.Следующий() Цикл
		СуммаВыплаты = 0;
		Удержание = 0;
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДополнительныеНачисления.Начисление КАК Доп,
			|	ОсновныеНачисления.Начисление КАК Осн,
			|	Удержания.Удержано КАК Удер
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления,
			|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления,
			|	РегистрРасчета.Удержания КАК Удержания
			|ГДЕ
			|	ДополнительныеНачисления.Сотрудник = &Сотрудник
			|	И ОсновныеНачисления.Сотрудник = &Сотрудник
			|	И Удержания.Сотрудник = &Сотрудник
			|	И ДополнительныеНачисления.Дата = &Дата
			|	И ОсновныеНачисления.Дата = &Дата
			|	И Месяц(Удержания.Дата) = &Дата";
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник.ПолучитьОбъект());
		Запрос.УстановитьПараметр("Дата", Месяц(Объект.Дата));
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СуммаВыплаты = СуммаВыплаты + ВыборкаДетальныеЗаписи.Доп;
			СуммаВыплаты = СуммаВыплаты + ВыборкаДетальныеЗаписи.Осн;
			Удержание = Удержание + ВыборкаДетальныеЗаписи.Удер;
		КонецЦикла;
		Если СуммаВыплаты > 0 Тогда
			НоваяСтрока = Объект.Выплаты.Добавить();
			НоваяСтрока.Сотрудник = Сотрудник.ПолучитьОбъект();
			НоваяСтрока.Сумма = СуммаВыплаты - Удержание;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не определена дата формирования расчетов с сотрудниками!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ВыполнитьАвтозаполнение();
КонецПроцедуры
